// splice: 
// 9. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].
// 10. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4].
// 11. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// 12. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].

let a = [1, 2, 3, 4, 5], b = [], c = [];

a.splice(1,2);

console.log(a);

a = [1, 2, 3, 4, 5];

b = a.splice(1,3);

console.log(b);

a = [1, 2, 3, 4, 5];

a.splice(3,0,'a', 'b', 'c');

console.log(a);

a = [1, 2, 3, 4, 5];

a.splice(2,0,'a', 'b', 2, 3, 4, 'c', 5, 'e')

console.log(a);